//6. Дано натуральное число n.Написать программу, которая вычисляет факториал неотрицательных целых
//чисел n(т.е.число целое и больше 0).Формула вычисления факториала приведена ниже.
//n!= 1 * 2 * 3*....*n, (формула вычисления факториала
//	числа n)


//#include <iostream>
//using namespace std;
//int main()
//{
//	int begin = 1, N,M=1, i = 1;
//	cout << "\n\tHello enter N!\n\t";
//	cin >> N;
//	
//	if (N>0)
//	{
//		cout << "\n\t" << N << "!" << "= ";
//		while (i <= N)
//		{
//			M = M * i;
//			cout << i++ << "*";
//			
//		}
//		cout << "\b" << " = " << M<<endl;
//	}
//	else
//	{
//		
//		cout<<"\n\t"<<N << " Error!!!, enter N>0" << endl;
//	}
//	
//	return 0;
//}

