//7. У швеи имеется ткань длиной L.Ей необходимо пошить подушки длиной P.Условно договоримся, что
//ширина ткани совпадает с шириной подушки.Определить сколько подушек сможет пошить швея, если
//умножать и делить она не умеет.

//#include<iostream>
//using namespace std;
//int main()
//{
//	int i=0, L, P=3;//Лічильник Довжина тканини, кількість подушок
//	cout << "\n\tHello enter L\n\t";
//	cin >> L;
//	
//	while (L>=3)
//	{
//		
//		L -=P;
//		i++;
//	}
//	cout<<"\n\t There will be   = " << i<<" pillows"<< endl;
//
//	return 0;
//}